# Enhanced Brewfile - Generated from system scan
# This includes tools you currently have installed that would be useful for a new setup

# ============================================================================
# THIRD-PARTY TAPS
# ============================================================================

tap "nahive/spotify-notify"     # Spotify notification tool

# ============================================================================
# CORE DEVELOPMENT TOOLS
# ============================================================================

# Version Control & Git
brew "git"
brew "gh"                     # GitHub CLI
brew "git-filter-repo"        # Git repo filtering tool

# Languages & Runtimes
brew "node"                   # Node.js
brew "python@3.13"            # Python 3.13
brew "go"                     # Go programming language
brew "ruby"                   # Ruby programming language
brew "lua"                    # Lua programming language
brew "perl"                   # Perl programming language

# Java & JVM
brew "openjdk@21"             # Java 21 LTS
brew "openjdk@17"             # Java 17 LTS
brew "scala"                  # Scala programming language
brew "sbt"                    # Scala build tool
brew "maven"                  # Java build tool
brew "mvndaemon/homebrew-mvnd/mvnd" # Maven daemon for faster builds
cask "corretto@11"            # Amazon Corretto 11 JDK
cask "corretto@17"            # Amazon Corretto 17 JDK

# ============================================================================
# COMMAND LINE TOOLS & UTILITIES
# ============================================================================

# Text Processing & Search
brew "ripgrep"                # Faster grep (rg)
brew "fd"                     # More useable find
brew "bat"                    # Improved cat with syntax highlighting
brew "fzf"                    # Fuzzy finder
brew "jq"                     # JSON processor
brew "tree"                   # Directory tree viewer
brew "htop"                   # Better top
brew "procs"                  # Modern ps
brew "eza"                    # Modern ls replacement
brew "glow"                   # Markdown reader
brew "git-delta"              # Enhanced git diff viewer (better than diff-so-fancy)
brew "gawk"                   # GNU awk with advanced features
brew "findutils"              # gives you gfind, gxargs, etc.
brew "gnu-sed"                # gsed for consistent -i behavior

# File Management
brew "zoxide"                 # Smart cd command
brew "entr"                   # File watcher

# Network & HTTP
brew "wget"                   # Web file downloader
brew "nmap"                   # Network discovery
brew "wifi-password"          # Get WiFi password

# System Tools
brew "coreutils"              # GNU core utilities
brew "shellcheck"             # Shell script linter
brew "mas"                    # Mac App Store CLI
brew "btop"                   # Beautiful process viewer
brew "tlrc"                   # Simplified man pages (tldr in Rust)
brew "readline"               # GNU readline library
brew "sqlite"                 # SQL database engine
brew "pssh"                   # Parallel SSH
brew "pstree"                 # See which process spawned which

# Testing Tools
brew "bats-core"              # Bash Automated Testing System

# ============================================================================
# DEVELOPMENT ENVIRONMENT
# ============================================================================

# Editors & IDEs
brew "neovim"                 # Modern vim replacement

# Version Managers
brew "pyenv"                  # Python version manager

# Package Managers
brew "pipenv"                 # Python package manager
brew "pipx"                   # Python app installer
brew "poetry"                 # Python dependency management
brew "tox"                    # Python testing automation
brew "yarn"                   # JavaScript package manager

# ============================================================================
# CLOUD & DEVOPS TOOLS
# ============================================================================

# Cloud Services
cask "gcloud-cli"             # Google Cloud CLI (alternative)
brew "kubectl"                # Kubernetes CLI
brew "k9s"                    # Kubernetes TUI
brew "kubecolor"              # Colorized kubectl
brew "kubeconform"            # Kubernetes manifest validation

# Containers
cask "docker"                 # Docker Desktop
cask "docker-desktop"         # Docker Desktop (explicit)

# ============================================================================
# PRODUCTIVITY & UTILITIES
# ============================================================================

# Productivity Apps
cask "alfred"                 # Spotlight replacement with workflows
cask "notion"                 # Note-taking and productivity

# Development Utilities
cask "devtoys"                # Developer utilities
cask "db-browser-for-sqlite"  # SQLite browser
brew "avro-tools"             # Apache Avro tools
brew "protobuf"               # Protocol buffers
brew "graphviz"               # Graph visualization software
brew "hyperfine"              # Performance measure tool

# ============================================================================
# MEDIA & CREATIVE
# ============================================================================

# Media Players & Tools
cask "vlc"                    # Media player
brew "flac"                   # FLAC audio codec
cask "spotify-notify"         # Spotify notification tool

# Fonts
cask "font-fira-code"         # Programming font with ligatures
cask "font-jetbrains-mono-nerd-font" # Font for terminal

# ============================================================================
# SYSTEM UTILITIES
# ============================================================================

# Compression & Archives
cask "the-unarchiver"         # Archive utility
brew "sevenzip"               # 7-Zip compression

# Screen & Recording
cask "tuple"                  # Screen sharing for pair programming

# Terminal & Shell
brew "starship"               # Cross-shell prompt
brew "zsh"                    # Z shell
cask "iterm2"                 # Terminal emulator

# QuickLook
cask "qlmarkdown"             # Markdown QuickLook
cask "qlstephen"              # QuickLook for many files

# ============================================================================
# MAC APP STORE APPS
# ============================================================================
# Note: Mac App Store apps are stored in Brewfile.mas and included automatically
# They are skipped during CI testing to avoid authentication requirements

